#### IndexTriangle Members

---

|  |
| --- |
| IndexTriangle Class   Constructors   Methods   Properties   See Also |

The  IndexTriangle  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | IndexTriangle | Constructs the triangle primitive. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  IndexPrimitive  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Index0 | The index of the triangle's first vertex. |
| Public property | Index1 | The index of the triangle's second vertex. |
| Public property | Index2 | The index of the triangle's third vertex. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  IndexPrimitive  .) |

# See Also

IndexTriangle Class

Autodesk.Revit.DB.DirectContext3D Namespace